{
  "errors": {
    "network": "Erreur réseau. Veuillez vérifier votre connexion et réessayer.",
    "server": "Erreur serveur. Veuillez réessayer plus tard.",
    "unauthorized": "Vous n'êtes pas autorisé à effectuer cette action.",
    "forbidden": "Accès refusé. Vous n'avez pas la permission d'effectuer cette action.",
    "validationFailed": "Veuillez vérifier votre saisie et réessayer.",
    "unexpected": "Une erreur inattendue s'est produite. Veuillez réessayer.",
    "invalidEmail": "Veuillez fournir une adresse email valide",
    "invalidPhone": "Veuillez fournir un numéro de téléphone valide avec l'indicatif pays (ex: +216-51-532-499)",
    "fullNameRequired": "Le nom complet est requis",
    "fullNameTooShort": "Le nom complet doit contenir au moins 2 caractères",
    "fullNameTooLong": "Le nom complet ne doit pas dépasser 100 caractères",
    "emailRequired": "L'adresse email est requise",
    "phoneRequired": "Le numéro de téléphone est requis",
    "companyNameRequired": "Le nom de l'entreprise est requis",
    "companyNameTooShort": "Le nom de l'entreprise doit contenir au moins 2 caractères",
    "companyNameTooLong": "Le nom de l'entreprise ne doit pas dépasser 100 caractères",
    "jobTitleRequired": "Le poste est requis",
    "companySizeRequired": "La taille de l'entreprise est requise",
    "businessTypeRequired": "Le type d'entreprise est requis",
    "yearsOfExperienceRequired": "Les années d'expérience sont requises",
    "yearsOfExperienceInvalid": "Les années d'expérience doivent être un nombre valide",
    "yearsOfExperienceTooHigh": "Les années d'expérience ne doivent pas dépasser 50 ans",
    "areaOfExpertiseRequired": "Le domaine d'expertise est requis",
    "areaOfExpertiseTooShort": "Le domaine d'expertise doit contenir au moins 10 caractères",
    "areaOfExpertiseTooLong": "Le domaine d'expertise ne doit pas dépasser 500 caractères",
    "resumeFileRequired": "Le fichier CV est requis",
    "invalidUrl": "Veuillez fournir une URL valide",
    "commentTooLong": "Le commentaire ne doit pas dépasser 1000 caractères",
    "fileUploadFailed": "Échec du téléchargement du fichier. Veuillez réessayer",
    "invalidFileType": "Type de fichier invalide. Veuillez télécharger un format supporté (PDF, DOC, DOCX, PNG, JPG)",
    "fileTooLarge": "La taille du fichier dépasse la limite autorisée",
    "fileSizeLimit": "La taille du fichier dépasse la limite maximale",
    "duplicateRequest": "Une demande de démo avec cet email existe déjà",
    "duplicateRequestWithId": "Une demande de démo existe déjà pour cet email",
    "rateLimitExceeded": "Trop de demandes de démo. Veuillez réessayer plus tard",
    "rateLimitWithRetry": "Trop de demandes. Veuillez attendre avant de réessayer",
    "emailSendFailed": "Échec de l'envoi de l'email de notification. Votre demande a été enregistrée avec succès",
    "processingFailed": "Échec du traitement de la demande de démo. Veuillez réessayer",
    "demoRequestNotFound": "Demande de démo non trouvée",
    "unauthorizedAccess": "Vous n'êtes pas autorisé à accéder à cette demande de démo"
  },
  "success": {
    "businessRequestSubmitted": "We’ve received your request! Our team will contact you soon to schedule a meeting and discuss how Coachini can support your business goals",
    "coachRequestSubmitted": "We’ve received your request! Our team will contact you soon to schedule a meeting and discuss how Coachini can support your business goals",
    "requestUpdated": "Demande de démo mise à jour avec succès",
    "requestDeleted": "Demande de démo supprimée avec succès",
    "statusUpdated": "Statut de la demande de démo mis à jour avec succès",
    "emailSent": "Email de notification envoyé avec succès",
    "fileUploaded": "Fichier téléchargé avec succès"
  },
  "suggestions": {
    "duplicateRequest": "Veuillez utiliser une adresse email différente ou contacter le support si vous devez modifier votre demande existante",
    "rateLimitExceeded": "Veuillez attendre quelques minutes avant de soumettre une autre demande",
    "invalidPhone": "Les numéros de téléphone doivent inclure l'indicatif pays, ex: +216-51-532-499 pour la Tunisie",
    "fileUploadFailed": "Veuillez vérifier le format et la taille de votre fichier, puis réessayer le téléchargement",
    "fileTooLarge": "Veuillez réduire la taille de votre fichier ou le compresser avant de le télécharger",
    "invalidFileType": "Veuillez télécharger des fichiers uniquement aux formats PDF, DOC, DOCX, PNG ou JPG",
    "emailSendFailed": "Votre demande a été enregistrée avec succès, mais nous n'avons pas pu envoyer l'email de confirmation. Vous pouvez contacter le support si nécessaire"
  }
}